In [1]:
import pandas as pd
import sqlite3

In [2]:
df = pd.read_csv("../data/cleaned_spacex_data.csv")
df.head()

,name,date_utc,success,rocket,launchpad,flight_number
0,FalconSat,2006-03-24T22:30:00.000Z,0,5e9d0d95eda69955f709d1eb,5e9e4502f5090995de566f86,1
1,DemoSat,2007-03-21T01:10:00.000Z,0,5e9d0d95eda69955f709d1eb,5e9e4502f5090995de566f86,2
2,Trailblazer,2008-08-03T03:34:00.000Z,0,5e9d0d95eda69955f709d1eb,5e9e4502f5090995de566f86,3
3,RatSat,2008-09-28T23:15:00.000Z,1,5e9d0d95eda69955f709d1eb,5e9e4502f5090995de566f86,4
4,RazakSat,2009-07-13T03:35:00.000Z,1,5e9d0d95eda69955f709d1eb,5e9e4502f5090995de566f86,5

In [3]:
conn = sqlite3.connect("spacex.db")
df.to_sql("spacex", conn, if_exists="replace", index=False)

205

In [4]:
query = """
SELECT strftime('%Y', date_utc) AS year, COUNT(*) AS total_launches
FROM spacex
GROUP BY year
ORDER BY year;
"""

pd.read_sql(query, conn)

    year  total_launches
0   2006               1
1   2007               1
2   2008               2
3   2009               1
4   2010               2
5   2012               2
6   2013               3
7   2014               6
8   2015               7
9   2016               9
10  2017              18
11  2018              21
12  2019              13
13  2020              26
14  2021              31
15  2022              62

In [5]:
query = """
SELECT success, COUNT(*) as count
FROM spacex
GROUP BY success;
"""

pd.read_sql(query, conn)

   success  count
0        0     24
1        1    181

In [6]:
query = """
SELECT strftime('%Y', date_utc) AS year,
       AVG(success) AS success_rate
FROM spacex
GROUP BY year
ORDER BY year;
"""

pd.read_sql(query, conn)

    year  success_rate
0   2006      0.000000
1   2007      0.000000
2   2008      0.500000
3   2009      1.000000
4   2010      1.000000
5   2012      1.000000
6   2013      1.000000
7   2014      1.000000
8   2015      0.857143
9   2016      0.888889
10  2017      1.000000
11  2018      1.000000
12  2019      1.000000
13  2020      1.000000
14  2021      1.000000
15  2022      0.693548